dev/artillery_load_test.yml
config:
  target: 'ws://localhost:4011/ws'
  processor: '../web/dst/bundle/loadtest.cjs'
  phases:
    - duration: 60
      arrivalRate: 25

scenarios:
  - name: 'sending_object_from_function'
    engine: ws
    flow:
      - function: 'gameEvent'
      - send: '{{ data }}'
      - think: 5
      - send: '{{ data }}'